Gregification/BeeMS/VT_MSPM0G3507_A/src/Tasks/examples/example_BQ796x2_PROTOCOL_V.cpp
/*
 * BQ796x2_PROTOCOL_Test_V.cpp
 *
 *  Created on: Jul 13, 2025
 *      Author: FSAE
 */

#include <FreeRTOS.h>
#include <task.h>
#include <stdio.h>
#include <ti/driverlib/driverlib.h>
#include <Tasks/examples/example_BQ769x2_PROTOCOL_V.hpp>
#include "Middleware/BQ769x2/BQ76952.hpp"
#include "Core/system.hpp"

void printBattStatus(uint16_t);
void printSafteyStatusA(uint8_t);
void printSafteyStatusB(uint8_t);
void printSafteyStatusC(uint8_t);
void printPFStatusA(uint8_t); // permanent failure alert
void printPFStatusB(uint8_t); // permanent failure alert
void printPFStatusC(uint8_t); // permanent failure alert
void printPFStatusD(uint8_t); // permanent failure alert
void printVCellMode(uint16_t);

#ifdef PROJECT_ENABLE_I2C1
void Task::BQ769x2_PROTOCOL_Test_V_Task(void*) {
    System::uart_ui.nputs(ARRANDN("BQ769x2_PROTOCOL_Test_V_Task Start" NEWLINE));

    char str[MAX_STR_LEN_COMMON];

    // -----------------------------------------------------------------------------

    BQ76952 bq;
    bq.i2c_controller   = &System::i2c1;
    bq.i2c_addr         = 0x8;

    bq.i2c_controller->setSCLTarget(10e3);

    vTaskDelay(pdMS_TO_TICKS(500));

    // -----------------------------------------------------------------------------

    { // reset device
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "resetting device ... "));
        if(bq.sendCommandSubcommand(BQ769X2_PROTOCOL::Cmd::BQ769x2_RESET))
                System::uart_ui.nputs(ARRANDN(CLIGOOD "tx succes"));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "tx fail"));
        vTaskDelay(pdMS_TO_TICKS(100));
    }

    { // dump cell config
        uint16_t v;

        v = 0xFFFF;
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "VCellMode ... "));
        if(bq.I2C_WriteReg(BQ769X2_PROTOCOL::RegAddr::VCellMode, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD "tx success . "));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "tx fail . "));
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::RegAddr::VCellMode, &v, sizeof(v))){
                System::uart_ui.nputs(ARRANDN(CLIGOOD "rx success "));
                printVCellMode(v);
        }
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "rx fail"));
    }

    { // disable & dump Permanent Failure register masks
        uint8_t v;
        v = 0x00;
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "disabling PFA ... "));
        if(bq.I2C_WriteReg(BQ769X2_PROTOCOL::RegAddr::EnabledPFA, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD "tx success . "));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "tx fail . "));
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::RegAddr::EnabledPFA, &v, sizeof(v))){
                System::uart_ui.nputs(ARRANDN(CLIGOOD "rx success "));
                snprintf(ARRANDN(str), "0x%02x", v);
                System::uart_ui.nputs(ARRANDN(str));
        }
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "rx fail"));

        v = 0x00;
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "disabling PFB ... "));
        if(bq.I2C_WriteReg(BQ769X2_PROTOCOL::RegAddr::EnabledPFB, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD "tx success . "));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "tx fail . "));
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::RegAddr::EnabledPFB, &v, sizeof(v))){
                System::uart_ui.nputs(ARRANDN(CLIGOOD "rx success "));
                snprintf(ARRANDN(str), "0x%02x", v);
                System::uart_ui.nputs(ARRANDN(str));
        }
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "rx fail"));

        v = 0x00;
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "disabling PFC ... "));
        if(bq.I2C_WriteReg((uint8_t)BQ769X2_PROTOCOL::RegAddr::EnabledPFC, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD "tx success . "));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "tx fail . "));
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::RegAddr::EnabledPFC, &v, sizeof(v))){
                System::uart_ui.nputs(ARRANDN(CLIGOOD "rx success "));
                snprintf(ARRANDN(str), "0x%02x", v);
                System::uart_ui.nputs(ARRANDN(str));
        }
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "rx fail"));

        v = 0x00;
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "disabling PFD ... "));
        if(bq.I2C_WriteReg(BQ769X2_PROTOCOL::RegAddr::EnabledPFD, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD "tx success . "));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "tx fail . "));
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::RegAddr::EnabledPFD, &v, sizeof(v))){
                System::uart_ui.nputs(ARRANDN(CLIGOOD "rx success "));
                snprintf(ARRANDN(str), "0x%02x", v);
                System::uart_ui.nputs(ARRANDN(str));
        }
        else    System::uart_ui.nputs(ARRANDN(CLIBAD "rx fail"));

        System::uart_ui.nputs(ARRANDN(CLIRESET NEWLINE));
    }

    { // dump status regs
        uint8_t v;

        v = 0xbe;
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::SafetyStatusA, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD));
        printSafteyStatusA(v);
        v = 0xbe;
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::SafetyStatusB, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD));
        printSafteyStatusB(v);
        v = 0xbe;
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::SafetyStatusC, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD));
        printSafteyStatusC(v);
        v = 0xbe;
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::PFStatusA, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD));
        printPFStatusA(v); // permanent failure alert
        v = 0xbe;
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::PFStatusB, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD));
        printPFStatusB(v); // permanent failure alert
        v = 0xbe;
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::PFStatusC, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD));
        printPFStatusC(v); // permanent failure alert
        v = 0xbe;
        if(bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::PFStatusD, &v, sizeof(v)))
                System::uart_ui.nputs(ARRANDN(CLIGOOD));
        else    System::uart_ui.nputs(ARRANDN(CLIBAD));
        printPFStatusD(v); // permanent failure alert

        System::uart_ui.nputs(ARRANDN(NEWLINE NEWLINE));
    }

//    if(0)
    {
        uint16_t v = 0xBEEF;

        // dump battery status
        bool success = bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::BatteryStatus, &v, sizeof(v));
        System::uart_ui.nputs(ARRANDN(success ? CLIGOOD : CLIBAD));
        printBattStatus(v);
        System::uart_ui.nputs(ARRANDN(CLIRESET));

        vTaskDelay(pdMS_TO_TICKS(1e3));
        System::uart_ui.nputs(ARRANDN(NEWLINE));

