Gregification/BeeMS/VT_MSPM0G3507_A/src/Tasks/examples/example_BQ796x2_PROTOCOL_V.cpp
    //Set the minimum cell balance voltage in charge - 0x933B = pBattParamsCfg->u16MinFullChgVoltThd_mV-100 mV
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::CellBalanceMinCellVCharge, 3.3 - 100, 2);
//        pBattParamsCfg->u16MinFullChgVoltThd_mV - 100, 2);
    //Set the minimum cell balance voltage in rest - 0x933F = pBattParamsCfg->u16MinFullChgVoltThd_mV-100 mV
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::CellBalanceMinCellVRelax, 3.3 - 100, 2);
//        pBattParamsCfg->u16MinFullChgVoltThd_mV - 100, 2);

    // Set up CUV (under-voltage) Threshold - 0x9275 = 0x31 (2479 mV)
    // CUV Threshold is this value multiplied by 50.6mV
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::CUVThreshold, 0x31, 1);
//    BQ769x2_SetRegister(
//        CUVThreshold, pBattParamsCfg->u16MinBattVoltThd_mV / 51, 1);

    // Set up COV (over-voltage) Threshold - 0x9278 = 0x55 (4301 mV)
    // COV Threshold is this value multiplied by 50.6mV
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::COVThreshold, 0x55, 1);
//    BQ769x2_SetRegister(
//        COVThreshold, pBattParamsCfg->u16MaxBattVoltThd_mV / 51, 1);

    // Set up OCC (over-current in charge) Threshold - 0x9280 = 0x05 (10 mV = 10A across 1mOhm sense resistor) Units in 2mV
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::OCCThreshold, 0x05, 1);
//    BQ769x2_SetRegister(
//        OCCThreshold, pBattParamsCfg->i16MaxChgCurtThd_mA / 2000, 1);

    // Set up OCD1 (over-current in discharge) Threshold - 0x9282 = 0x0A (20 mV = 20A across 1mOhm sense resistor) units of 2mV
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::OCD1Threshold, 0x0A, 1);
//    BQ769x2_SetRegister(
//        OCD1Threshold, pBattParamsCfg->i16MinDhgCurtThd_mA / 2000, 1);

    // Set up SCD (short discharge current) Threshold - 0x9286 = 0x05 (100 mV = 100A across 1mOhm sense resistor)  0x05=100mV
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::SCDThreshold, 0x05, 1);
//    BQ769x2_SetRegister(
//        SCDThreshold, pBattParamsCfg->i16MaxChgCurtThd_mA / 2000, 1);

    // Set up SCD Delay - 0x9287 = 0x03 (30 us) Enabled with a delay of (value - 1) * 15 us; min value of 1
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::SCDDelay, 0x03, 1);

    // Set up SCDL Latch Limit to 1 to set SCD recovery only with load removal 0x9295 = 0x01
    // If this is not set, then SCD will recover based on time (SCD Recovery Time parameter).
    bq.setRegister(BQ769X2_PROTOCOL::RegAddr::SCDLLatchLimit, 0x01, 1);


    vTaskDelay(pdMS_TO_TICKS(8));
    // Exit CONFIGUPDATE mode  - Subcommand 0x0092
    bq.sendCommandSubcommand(BQ769X2_PROTOCOL::Cmd::EXIT_CFGUPDATE);
    vTaskDelay(pdMS_TO_TICKS(8));
    //Control All FETs on
    bq.sendCommandSubcommand(BQ769X2_PROTOCOL::Cmd::FET_ENABLE);
    vTaskDelay(pdMS_TO_TICKS(8));
    bq.sendCommandSubcommand(BQ769X2_PROTOCOL::Cmd::ALL_FETS_ON);
    vTaskDelay(pdMS_TO_TICKS(8));
    bq.sendCommandSubcommand(BQ769X2_PROTOCOL::Cmd::SLEEP_DISABLE);
    vTaskDelay(pdMS_TO_TICKS(8));

    // -----------------------------------------------------------------------------

    const BQ769X2_PROTOCOL::CmdDrt cmds[] = {
             BQ769X2_PROTOCOL::CmdDrt::Cell1Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell2Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell3Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell4Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell5Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell6Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell7Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell8Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell9Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell10Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell12Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell13Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell14Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell15Voltage,
             BQ769X2_PROTOCOL::CmdDrt::Cell16Voltage
        };

//    while(1)
    {
        uint16_t v = 0xBEEF;

        // dump battery status
        bool success = bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::BatteryStatus, &v, sizeof(v));
        System::uart_ui.nputs(ARRANDN(success ? CLIGOOD : CLIBAD));
        printBattStatus(v);
        System::uart_ui.nputs(ARRANDN(CLIRESET));

        vTaskDelay(pdMS_TO_TICKS(5e3));
        System::uart_ui.nputs(ARRANDN(NEWLINE NEWLINE NEWLINE));
    }


    while(true){
        for(uint8_t i = 0; i < sizeof(cmds); i++){
            uint16_t v = 0xBEEF;
            bool success = bq.I2C_ReadReg(cmds[i], &v, sizeof(v));

            snprintf(ARRANDN(str), "%6d,", v);

            System::uart_ui.nputs(ARRANDN(success ? CLIGOOD : CLIBAD));
            System::uart_ui.nputs(ARRANDN(str));
            System::uart_ui.nputs(ARRANDN(CLIRESET));

            vTaskDelay(pdMS_TO_TICKS(200));
        }
        System::uart_ui.nputs(ARRANDN(NEWLINE));
    }

    System::uart_ui.nputs(ARRANDN("BQ769x2_PROTOCOL_Test_V_Task End" NEWLINE));
    vTaskDelete(NULL);
}
#else
void Task::BQ769x2_PROTOCOL_Test_V_Task(void*){
    vTaskDelete(NULL);
};
#endif

void printBattStatus(uint16_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printBattStatus: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%04x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "CFG_UPDATE mode ? "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"PCHG_UPDATE mode ? "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"SLEEP_en ? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"POR ? "));
    System::uart_ui.nputs(ARRANDN((v & BV(3)) ? "1" : "0"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"WD : "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN("previous reset caused by WD"));
    else               System::uart_ui.nputs(ARRANDN("previous reset normal"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"COW_CHK (Cell Open Wire Check active)? "));
    if((v & BV(5)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"OTPW (OTP write pending)? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"OTPB (OTP write blocked)? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    // SEC bits (9:8)
    uint8_t sec = (v >> 8) & 0x03;
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Security mode: "));
    switch (sec) {
        case 0:
            System::uart_ui.nputs(ARRANDN("Not initialized"));
            break;
        case 1:
            System::uart_ui.nputs(ARRANDN("FULLACCESS"));
            break;
        case 2:
            System::uart_ui.nputs(ARRANDN("UNSEALED"));
            break;
        case 3:
            System::uart_ui.nputs(ARRANDN("SEALED"));
            break;
    }

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"FUSE pin asserted? "));
    if((v & BV(10)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Safety fault (SS)? "));
    if((v & BV(11)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Permanent Fail (PF)? "));
    if((v & BV(12)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "none"));

