Gregification/BeeMS/VT_MSPM0G3507_A/src/Tasks/examples/example_BQ796x2_PROTOCOL_V.cpp
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Shutdown pending (SDM)? "));
    if((v & BV(13)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Reserved bit (14): "));
    System::uart_ui.nputs(ARRANDN((v & BV(14)) ? "1" : "0"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Device in SLEEP mode? "));
    if((v & BV(15)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

void printSafteyStatusA(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printSafteyStatusA: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 7: SCD (Short Circuit in Discharge) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Short Circuit in Discharge (SCD) fault? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 6: OCD2 (Overcurrent in Discharge 2nd Tier) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Overcurrent in Discharge 2nd Tier (OCD2) fault? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 5: OCD1 (Overcurrent in Discharge 1st Tier) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Overcurrent in Discharge 1st Tier (OCD1) fault? "));
    if((v & BV(5)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 4: OCC (Overcurrent in Charge) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Overcurrent in Charge (OCC) fault? "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 3: COV (Cell Overvoltage Protection) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Cell Overvoltage (COV) fault? "));
    if((v & BV(3)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 2: CUV (Cell Undervoltage Protection) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Cell Undervoltage (CUV) fault? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 1: Reserved bit (1) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Reserved bit (1): "));
    System::uart_ui.nputs(ARRANDN((v & BV(1)) ? "1" : "0"));

    // --- Bit 0: Reserved bit (0) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Reserved bit (0): "));
    System::uart_ui.nputs(ARRANDN((v & BV(0)) ? "1" : "0"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

void printSafteyStatusB(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printSafteyStatusB: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 7: OTF (FET Overtemperature) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"FET Overtemperature (OTF) fault? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 6: OTINT (Internal Overtemperature) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Internal Overtemperature (OTINT) fault? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 5: OTD (Overtemperature in Discharge) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Overtemperature in Discharge (OTD) fault? "));
    if((v & BV(5)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 4: OTC (Overtemperature in Charge) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Overtemperature in Charge (OTC) fault? "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 3: Reserved bit (3) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Reserved bit (3): "));
    System::uart_ui.nputs(ARRANDN((v & BV(3)) ? "1" : "0"));

    // --- Bit 2: UTINT (Internal Undertemperature) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Internal Undertemperature (UTINT) fault? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 1: UTD (Undertemperature in Discharge) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Undertemperature in Discharge (UTD) fault? "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 0: UTC (Undertemperature in Charge) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Undertemperature in Charge (UTC) fault? "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

void printSafteyStatusC(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printSafteyStatusC: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 7: OCD3 (Overcurrent in Discharge 3rd Tier) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Overcurrent in Discharge 3rd Tier (OCD3) fault? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 6: SCDL (Short Circuit in Discharge Latch) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Short Circuit in Discharge (SCDL) latch fault? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 5: OCDL (Overcurrent in Discharge Latch) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Overcurrent in Discharge (OCDL) latch fault? "));
    if((v & BV(5)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

