Gregification/BeeMS/VT_MSPM0G3507_A/src/Tasks/examples/example_BQ796x2_PROTOCOL_V.cpp
    // --- Bit 4: COVL (Cell Overvoltage Latch) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell Overvoltage (COVL) latch fault? "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 3: Reserved bit (3) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Reserved bit (3): "));
    System::uart_ui.nputs(ARRANDN((v & BV(3)) ? "1" : "0"));

    // --- Bit 2: PTO (Precharge Timeout) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Precharge Timeout (PTO) fault? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 1: HWDF (Host Watchdog Fault) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Host Watchdog (HWDF) fault? "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 0: Reserved bit (0) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Reserved bit (0): "));
    System::uart_ui.nputs(ARRANDN((v & BV(0)) ? "1" : "0"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

// permanent failure alert
void printPFStatusA(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printPFStatusA: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 7: CUDEP (Copper Deposition Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Copper Deposition (CUDEP) permanent fail? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 6: SOTF (Safety Overtemperature FET Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Safety Overtemperature FET (SOTF) permanent fail? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 5: Reserved bit (5) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Reserved bit (5): "));
    System::uart_ui.nputs(ARRANDN((v & BV(5)) ? "1" : "0"));

    // --- Bit 4: SOT (Safety Overtemperature Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Safety Overtemperature (SOT) permanent fail? "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 3: SOCD (Safety Overcurrent in Discharge Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Safety Overcurrent in Discharge (SOCD) permanent fail? "));
    if((v & BV(3)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 2: SOCC (Safety Overcurrent in Charge Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Safety Overcurrent in Charge (SOCC) permanent fail? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 1: SOV (Safety Cell Overvoltage Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Safety Cell Overvoltage (SOV) permanent fail? "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 0: SUV (Safety Cell Undervoltage Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Safety Cell Undervoltage (SUV) permanent fail? "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

// permanent failure alert
void printPFStatusB(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printPFStatusB: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 7: SCDL (Short Circuit in Discharge Latch Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Short Circuit Discharge Latch (SCDL) permanent fail? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 6: Reserved bit (6) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Reserved bit (6): "));
    System::uart_ui.nputs(ARRANDN((v & BV(6)) ? "1" : "0"));

    // --- Bit 5: Reserved bit (5) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Reserved bit (5): "));
    System::uart_ui.nputs(ARRANDN((v & BV(5)) ? "1" : "0"));

    // --- Bit 4: VIMA (Voltage Imbalance Active Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Voltage Imbalance Active (VIMA) permanent fail? "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 3: VIMR (Voltage Imbalance at Rest Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Voltage Imbalance at Rest (VIMR) permanent fail? "));
    if((v & BV(3)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 2: 2LVL (Second Level Protector Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Second Level Protector (2LVL) permanent fail? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 1: DFETF (Discharge FET Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Discharge FET (DFETF) permanent fail? "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 0: CFETF (Charge FET Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Charge FET (CFETF) permanent fail? "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

