Gregification/BeeMS/VT_MSPM0G3507_A/src/Tasks/examples/example_BQ796x2_PROTOCOL_V.cpp
// permanent failure alert
void printPFStatusC(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printPFStatusC: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 7: CMDF (Commanded Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Commanded Permanent Fail (CMDF)? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 6: HWMX (Hardware Mux Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Hardware Mux (HWMX) permanent fail? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 5: VSSF (Internal VSS Measurement Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Internal VSS Measurement (VSSF) permanent fail? "));
    if((v & BV(5)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 4: VREF (Internal Voltage Reference Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Internal Voltage Reference (VREF) permanent fail? "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 3: LFOF (Internal LFO Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Internal LFO (LFOF) permanent fail? "));
    if((v & BV(3)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 2: IRMF (Instruction ROM Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Instruction ROM (IRMF) permanent fail? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 1: DRMF (Data ROM Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Data ROM (DRMF) permanent fail? "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 0: OTPF (OTP Memory Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "OTP Memory (OTPF) permanent fail? "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

// permanent failure alert
void printPFStatusD(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printPFStatusD: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // bits 7:1 reserved

    // --- Bit 0: TOSF (Top of Stack vs Cell Sum Permanent Fail) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Top of Stack vs Cell Sum (TOSF) permanent fail? "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

void printVCellMode(uint16_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printVCellMode: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 15: Cell 16 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 16 Mode: "));
    if((v & BV(15)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 14: Cell 15 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 15 Mode: "));
    if((v & BV(14)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 13: Cell 14 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 14 Mode: "));
    if((v & BV(13)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 12: Cell 13 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 13 Mode: "));
    if((v & BV(12)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 11: Cell 12 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 12 Mode: "));
    if((v & BV(11)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 10: Cell 11 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 11 Mode: "));
    if((v & BV(10)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 9: Cell 10 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 10 Mode: "));
    if((v & BV(9)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 8: Cell 9 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 9 Mode: "));
    if((v & BV(8)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 7: Cell 8 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 8 Mode: "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 6: Cell 7 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 7 Mode: "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 5: Cell 6 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 6 Mode: "));
    if((v & BV(5)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 4: Cell 5 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 5 Mode: "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 3: Cell 4 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 4 Mode: "));
    if((v & BV(3)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 2: Cell 3 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 3 Mode: "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 1: Cell 2 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 2 Mode: "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    // --- Bit 0: Cell 1 Mode ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "Cell 1 Mode: "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "enabled"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "disabled"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}
